Catalogs/КлассификаторТНВЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторТНВЭД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементОбработан</Name>
					<Comment>Произведено заполнение единицы измерения при обновлении ИБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СырьевойТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Маркируется</Name>
					<Comment>[A2105505-384] Разработка по ФДР С13.001 Доработка документа "Заказ клиента" (передача на комиссию)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаДляМаркетплейсов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаДляРозницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторТНВЭД/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьФормуПоОбъекту();
	КонецЕсли;
	
	// --> Евлахов Игорь Николаевич (Начало) 04.03.2024
	// Задача #3874	
	злПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	// <-- Евлахов Игорь Николаевич (Конец) 04.03.2024

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ДанныеОбъекта = РеквизитФормыВЗначение("Объект");
	ДанныеОбъекта.ПроверитьУникальность(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуПоОбъекту()
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	
КонецПроцедуры

#КонецОбласти


#Область злОбработчикиСобытийФормы 

&НаСервере
Процедура злПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	злМодификацияФормы(Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#Область злСлужебныеПроцедурыИФункции

&НаСервере
Процедура злМодификацияФормы(Отказ, СтандартнаяОбработка)
		
	#Область ЭлементыФормы
	// << 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
	// КР_Маркируется
	КР_МаркируетсяЭлемент = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Объект.КР_Маркируется", ЭтотОбъект);
	КР_МаркируетсяЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	// >> 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
	
	// --> Евлахов Игорь Николаевич (Начало) 04.03.2024
	// Задача #3874
	злМаркировкаОстатков = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Объект.злМаркировкаОстатков", ЭтотОбъект);
	злМаркировкаОстатков.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	злМаркировкаДляМаркетплейсов = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Объект.злМаркировкаДляМаркетплейсов", ЭтотОбъект);
	злМаркировкаДляМаркетплейсов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

	злМаркировкаДляРозницы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Объект.злМаркировкаДляРозницы", ЭтотОбъект);
	злМаркировкаДляРозницы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	// <-- Евлахов Игорь Николаевич (Конец) 04.03.2024
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти
